#### Question 10

In [102]:
import pandas as pd

In [103]:
import matplotlib.pyplot as plt

In [104]:
df = pd.read_csv("emp_database.csv")

i) Print the first and last row of data frame using iloc.

In [105]:
# first row
first_row = df.iloc[0]
print(first_row)

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [106]:
#last row 
last_row = df.iloc[-1]
print(last_row)

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

ii) Retrieve the second column of data frame.

In [107]:
second_col = df["last_name"]
print(second_col)

0      Tomkiewicz
1       Zigomalas
2         Andrade
3       Mcwalters
4          Veness
          ...
495          Veit
496       Euresti
497      Brenning
498         Keeny
499        Richan
Name: last_name, Length: 500, dtype: object

iii) Filter the first two columns of data frame with all rows. (1M)

In [108]:
first_two = df[["first_name","last_name"]]
first_two.head()

  first_name   last_name
0    Aleshia  Tomkiewicz
1       Evan   Zigomalas
2     France     Andrade
3    Ulysses   Mcwalters
4     Tyisha      Veness

iv) Select and print 1st, 4th, 7th, 25th row + 1st, 6th
, 7
th columns. (1M)

In [109]:
df_temp = df.iloc[[1,4,7,25]]
df_temp = df_temp[["first_name","county","postal"]]
df_temp

   first_name           county    postal
1        Evan  Buckinghamshire  HP11 2AX
4      Tyisha    West Midlands   B70 9DT
7     Laquita      Tyne & Wear  NE29 7AD
25    Leonard    Western Isles   HS1 2PZ

vi) Select rows with index values 'Andrade' and 'Veness', with all
columns between 'city' and 'email'. (2M)

In [110]:
df.set_index("last_name", inplace=True)
df.head()

,first_name,company_name,address,city,county,postal,phone1,phone2,email,web
last_name,,,,,,,,,,
Tomkiewicz,Aleshia,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
Zigomalas,Evan,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
Andrade,France,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
Mcwalters,Ulysses,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
Veness,Tyisha,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [111]:
df.loc[['Andrade', 'Veness'], 'city':'email']

,city,county,postal,phone1,phone2,email
last_name,,,,,,
Andrade,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com
Veness,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com

vii)Select rows where the email column ends with 'hotmail.com',
include all columns.

In [120]:
df_new = pd.read_csv("emp_database.csv")

df_email = df_new["email"].str.endswith('@hotmail.com')

In [121]:
print(df_email)

0       True
1      False
2       True
3       True
4       True
       ...
495    False
496    False
497    False
498    False
499     True
Name: email, Length: 500, dtype: bool